/*Во низа од N природни броеви (N и низата се читаат од СВ) да си ги заменат позициите соседните взаемно прости броеви
(два броја се взаемно прости ако немаат заеднички делители). На ист елемент од низата може најмногу еднаш да му се изврши замена.
Да се испечати на СИ изменетата низа.

Замената на два броја да се реализира во посебна функција.*/
#include<stdio.h>
#define MAX 100
int gcd ( int a, int b )
{
  int c;
  while ( a != 0 ) {
     c = a; a = b%a;  b = c;
  }
  return b;
}
void swap (int *a, int j){
    int tmp=*(a+j);
    *(a+j)=*(a+j+1);
    *(a+j+1)=tmp;
}
int main (){
    int a[MAX];
    int n;
    scanf("%d", &n);
    int i;
    for(i=0; i<n; ++i){
        scanf("%d", &a[i]);
    }
    for(i=0; i<n-1; ++i){
        if(gcd(a[i],a[i+1])==1){
            swap(a,i);
            i++;
        }
    }
    for(i=0;i<n;i++){
        printf("%d ",a[i]);
    }
    return 0;
}
