#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>
/*Да се напише програма која ќе ги пронаоѓа сите зборови кои истовремено почнуваат и завршуваат на дадена буква во датотеката
 со име „zborovi.txt“. Во првиот ред на оваа датотека е запишана само бараната буква. Програмата треба да ги ископира сите вакви
 зборови на стандарден излез, пришто мора да е запазен редоследот на редовите (зборовите кои се наоѓале во вториот ред на „zborovi.txt“
треба да бидат ископирани во првиот ред на излезот, зборовите од третиот ред да бидат ископирани во вториот ред на излезот, итн.).
Меѓу секои два збора мора да има точно едно празно место. На крај, во нов ред да се испечати и бројот на сите ископирани зборови.
Да се претпостави дека зборовите во датотеката „zborovi.txt“ се составени од алфанумерички знаци и се меѓусебно разделени со еден
или повеќе специјални знаци/празни места. Максималниот број на знаци во еден ред е 100. Забелешка. После последниот збор во секој
ред да се отпечати точно едно празно место.*/
void wtf()
{
    FILE *f=fopen("zborovi.txt" , "w");
    char c;
    while((c=getchar())!='#')
        fputc(c,f);
fclose(f);
}
int main()
{
    wtf();
    FILE *f;
    if((f=fopen("zborovi.txt" , "r"))==NULL)
    {
        printf("unable to open");
        return -1;
    }
    char red[100],zbor[100],c;
    fscanf(f,"%c" , &c);
    int i,j=0,vozbor=0,br=0;
    while((fgets(red,100,f))>0)
    {
        for(i=0;i<strlen(red);i++)
        {
            if(isalnum(red[i]))
            {
                vozbor=1;
                zbor[j]=red[i];
                j++;
            }
            else
            {
                if(vozbor)
                {
                    zbor[j]='\0';
                    if(c==zbor[0] && c==zbor[strlen(zbor)-1])
                    {
                        br++;
                        printf("%s " , zbor);
                    }
                    j=0;
                }
            }
        }
    printf("\n");
    }
printf("%d" , br);
fclose(f);
return 0;
}
