#include <stdio.h>
#include <stdlib.h>
/*Да се напише рекурзивна функција simetrichno која за аргумент прима низа од n цели броеви, и по нејзиното завршување
првичната низа ја претвора во таканаречена _симетрична низа_ на следниот начин: првиот елемент го заменува со производот
од тој елемент и последниот елемент од низата, вториот го заменува со производот од тој елемент и претпоследниот елемент од
 низата, итн. до крај на низата (т.е. до последниот елемент кој го заменува со производот од тој број и првиот број). Доколку
 низата има среден елемент тој се заменува со неговиот производ со самиот себе (на пример, низата 4, 7, 5, 22, 9 ја претвора во
низа 36(=4_9), 154(=7_22), 25(=5_5), 154(=22_7), 36(=9*4)). (Дозволено е да се додадат дополнителни аргументи на функцијата).
Да се направи програма која од тастатура ќе прочита цел број n (0 < n < 100), и потоа уште n цели броеви – елементи на низата.
Низата прво да се испечати на екран, потоа да се повика функцијата simetrichno за дадената низа и на крајот повторно да се испечати низата на екран.
*/
void simetrichno(int a[],int n,int start,int n1)
{
    if(start==n)
        return;
    if(start<n/2)
        printf("%d " , a[start]*a[n1-1]);
    else if(start>n/2)
        printf("%d " , a[start]*a[n-start-1]);
    else
        printf("%d " , a[start]*a[start]);
simetrichno(a,n,++start,--n1);
}
int main()
{
    int a[100],n,i;
    scanf("%d" , &n);
    for(i=0;i<n;i++)
        scanf("%d" , &a[i]);
    simetrichno(a,n,0,n);
}
