/**Квадрат од знаци Problem 1 (1 / 1)
Да се направи функција Kvadrat(), која ќе прима еден аргумент - природен број m и на СИ ќе печати ѕвезден квадрат
од ред m - квадрат составен од m * m ѕвездички (функцијата НЕ ТРЕБА да враќа вредност!). Од СВ се чита еден природен број n.
Користејќи ја функцијата Kvadrat(), на СИ да се испечатат сите ѕвездени квадрати од ред помал или еднаков на n, во растечки редослед (види пример!).
Sample input
2
Sample output
*
**
**

*/
#include <stdio.h>
#include <stdlib.h>
void Kvadrat (int a)
{
    int i,j;
    for(i=1;i<=a;i++){
        for(j=1;j<=a;j++)
        {
            printf("*");
        }
        printf("\n");
    }
}
int main()
{
    system ("color 2");
    int n,i;
    scanf("%d" , &n);
    for(i=1;i<=n;i++)
        Kvadrat(i);
}

