#include <stdio.h>
#include <stdlib.h>
/*Да се напише рекурзивна функција која од даден природен број ќе го врати збирот на сите
парни цифри кои во исто време се наоѓаат на парни позиции, гледано од десно кон лево. Се смета
 дека најмалку значајната цифра се наоѓа на 1-та позиција.
 Влез: 74126				Излез: 4+2 = 6 */
int zbir(int n)
{
    if(n<=10)
        return 0;
    else if(n/10%10%2==0)
        return n/10%10+zbir(n/100);
}
int main()
{
    int n;
    scanf("%d" , &n);
    printf("%d" , zbir(n));
}
