#include <stdio.h>
#include <stdlib.h>
#define MAX 100
/*•	Oд стандарден влез се вчитува матрица со димензии M x N. Да се напише програма која во друга
 матрица со исти димензии, секој елемент ќе го замени со збирот на неговите соседни елементи (по хоризонтала и вертикала)
 кои се поголеми од самиот тој елемент. Соседни елементи на еден елемент во матрицата се елементите кои се наоѓаат горе,
 долу, лево и десно од самиот елемент (ако елементот е дел од првата или последната редица или колона му недостасува некој сосед).
•	Пример:
•	4  2  7  11 		0  19  27  0
    3  8  16  1		    29  16  0  32
    17  8  9  5		    0  40  16  16
    6  14  4  7		    31  0  30  0
•	Во примерот соседи на елементот 4 се 3, 2, додека соседи на елементот 9 се 16, 8, 5, 4. Почетна сума за секој елемент е 0.
*/
int main()
{
    int a[MAX][MAX],b[MAX][MAX],i,j,m,n;
    scanf("%d%d" , &m,&n);
    for(i=0;i<m;i++)
        for(j=0;j<n;j++)
            scanf("%d" , &a[i][j]);
    for(i=0;i<m;i++)
        for(j=0;j<n;j++)
            b[i][j]=0;
    for(i=0;i<m;i++)
        for(j=0;j<n;j++)
        {
            if(i==0 && j==0)
            {
                if(a[i][j+1]>a[i][j])
                    b[i][j]+=a[i][j+1];
                if(a[i+1][j]>a[i][j])
                    b[i][j]+=a[i+1][j];
            }
            else if(i==0 && j==n-1)
            {
                if(a[i][j-1]>a[i][j])
                    b[i][j]+=a[i][j];
                if(a[i+1][j]>a[i][j])
                    b[i][j]+=a[i+1][j];
            }
            else if(i==m-1 && j==0)
            {
                if(a[i][j+1]>a[i][j])
                    b[i][j]+=a[i][j+1];
                if(a[i-1][j]>a[i][j])
                    b[i][j]+=a[i-1][j];
            }
            else if(i==m-1 && j==n-1)
            {
                if(a[i][j-1]>a[i][j])
                    b[i][j]+=a[i][j+1];
                if(a[i-1][j]>a[i][j])
                    b[i][j]+=a[i-1][j];
            }
            else if(i==0)
            {
                if(a[i+1][j]>a[i][j])
                    b[i][j]+=a[i+1][j];
                if(a[i][j+1]>a[i][j])
                    b[i][j]+=a[i][j+1];
                if(a[i][j-1]>a[i][j])
                    b[i][j]+=a[i][j-1];
            }
            else if(i==m-1)
            {
                if(a[i-1][j]>a[i][j])
                    b[i][j]+=a[i-1][j];
                if(a[i][j+1]>a[i][j])
                    b[i][j]+=a[i][j+1];
                if(a[i][j-1]>a[i][j])
                    b[i][j]+=a[i][j-1];
            }
            else if(j==0)
            {
                if(a[i-1][j]>a[i][j])
                    b[i][j]+=a[i-1][j];
                if(a[i+1][j]>a[i][j])
                    b[i][j]+=a[i+1][j];
                if(a[i][j+1]>a[i][j])
                    b[i][j]+=a[i][j+1];
            }
            else if(j==n-1)
            {
                if(a[i-1][j]>a[i][j])
                    b[i][j]+=a[i-1][j];
                if(a[i+1][j]>a[i][j])
                    b[i][j]+=a[i+1][j];
                if(a[i][j-1]>a[i][j])
                    b[i][j]+=a[i][j-1];
            }
            else
            {
                if(a[i-1][j]>a[i][j])
                    b[i][j]+=a[i-1][j];
                if(a[i+1][j]>a[i][j])
                    b[i][j]+=a[i+1][j];
                if(a[i][j-1]>a[i][j])
                    b[i][j]+=a[i][j-1];
                if(a[i][j+1]>a[i][j])
                    b[i][j]+=a[i][j+1];
            }
        }
    for(i=0;i<m;i++){
        for(j=0;j<n;j++)
            printf("%d " , b[i][j]);
            printf("\n");}
}


