#include <stdio.h>
#include <stdlib.h>
#define MAX 100
/*•	Oд стандарден влез се вчитува матрица со димензии M x N. Да се напише програма која ќе ги најде и отпечати на стандарден излез
двата дијагонално соседни елементи со максимална сума.
Во примерот елементите во сино и црвено се пример за дијагонално соседни елементи, а десно се резултантните два дијагонално соседни елементи
со максимална сума.
Пример влез
4 4
4 2 7 11
3 8 16 1
17 12 9 5
6 14 4 7
Пример излез
17 14

*/
int main()
{
    int a[MAX][MAX],maxSum,i,j,m,n,i_tmp,j_tmp,flag=1;
    scanf("%d%d" , &m , &n);
    for(i=0;i<m;i++)
        for(j=0;j<n;j++)
            scanf("%d" , &a[i][j]);
    for(i=0;i<m-1;i++)
        for(j=0;j<n-1;j++)
    {
        if(flag)
        {
            maxSum=(a[i][j]+a[i+1][j+1]);
            i_tmp=i;
            j_tmp=j;
            flag=0;
        }
        else
        {
            if((a[i][j]+a[i+1][j+1])>maxSum)
            {
                maxSum=(a[i][j]+a[i+1][j+1]);
                i_tmp=i;
                j_tmp=j;
            }
        }
    }
    printf("%d %d" , a[i_tmp][j_tmp] , a[i_tmp+1][j_tmp+1]);
}
