#include <stdio.h>
#include <stdlib.h>
#define MAX 100
/*•	Oд стандарден влез се вчитува матрица со димензии M x N. Да се напише програма која во друга матрица со исти
димензии секој елемент ќе го замени со производот на неговите соседни елементи (по двете дијагонали) кои се помали
од самиот тој елемент. Соседни елементи на еден елемент во матрицата се елемнтите кои се наоѓаат горе-лево, долу-лево,
горе-десно и долу-десно од самиот тој елемент (ако елементот е дел од првата или последната редица или колона му недостасува по некој сосед).
•	Пример:
•	4  2  7  11		1    1   1    1
    3  8  16  1		2    28  1320 1
    17  12  9  5	112  72  56   1
    6  14  4  7		1    9   1    1
*/
int main()
{
    int a[MAX][MAX],b[MAX][MAX],i,j,m,n;
    scanf("%d%d" , &m,&n);
    for(i=0;i<m;i++)
        for(j=0;j<n;j++)
            scanf("%d" , &a[i][j]);
    for(i=0;i<m;i++)
        for(j=0;j<n;j++)
            b[i][j]=1;
    for(i=0;i<m;i++)
        for(j=0;j<n;j++)
        {
            if(i==0 && j==0)
            {
                if(a[i+1][j+1]<a[i][j])
                    b[i][j]*=a[i+1][j+1];
            }
            else if(i==0 && j==n-1)
            {
                if(a[i+1][j-1]<a[i][j])
                    b[i][j]*=a[i+1][j-1];
            }
            else if(i==m-1 && j==n-1)
            {
                if(a[i-1][j-1]<a[i][j])
                    b[i][j]*=a[i-1][j-1];
            }
            else if(i==m-1 && j==0)
            {
                if(a[i-1][j+1]<a[i][j])
                    b[i][j]*=a[i-1][j+1];
            }
            else if(i==0)
            {
                if(a[i+1][j+1]<a[i][j])
                    b[i][j]*=a[i+1][j+1];
                if(a[i+1][j-1]<a[i][j])
                    b[i][j]*=a[i+1][j-1];
            }
            else if(i==m-1)
            {
                if(a[i-1][j+1]<a[i][j])
                    b[i][j]*=a[i-1][j+1];
                if(a[i-1][j-1]<a[i][j])
                    b[i][j]*=a[i-1][j-1];
            }
            else if(j==0)
            {
                if(a[i+1][j+1]<a[i][j])
                    b[i][j]*=a[i+1][j+1];
                if(a[i-1][j+1]<a[i][j])
                    b[i][j]*=a[i-1][j+1];
            }
            else if(j==n-1)
            {
                if(a[i+1][j-1]<a[i][j])
                    b[i][j]*=a[i+1][j-1];
                if(a[i-1][j-1]<a[i][j])
                    b[i][j]*=a[i-1][j-1];
            }
            else
            {
                if(a[i+1][j+1]<a[i][j])
                    b[i][j]*=a[i+1][j+1];
                if(a[i+1][j-1]<a[i][j])
                    b[i][j]*=a[i+1][j-1];
                if(a[i-1][j+1]<a[i][j])
                    b[i][j]*=a[i-1][j+1];
                if(a[i-1][j-1]<a[i][j])
                    b[i][j]*=a[i-1][j-1];
            }
        }
    for(i=0;i<m;i++){
        for(j=0;j<n;j++)
            printf("%d " , b[i][j]);
            printf("\n");}

}


