/*Дадени се две низи со ист број на елементи во чии полиња се сместува злато во килограми. Во првата низа максималната количина
на злато што може да се смести во секое поле е 500 килограми, додека во втората е неограничено. Напишете функција која ги заменува
килограмите од првата и втората низа (елементите на исти позиции) ако во елементот во првата низа има повеќе од 500 кг., а елементот
во втората низа помалку од 500 кг. Ако во двата соодветни елементи има повеќе од 500 кг. тогаш златото во елементот од првата низа се
 уништува (се запишува нула). Задачата да се реши со покажувачи.

Пример:

За низите 100 501 600 и 200 300 700 треба да се испечатат низите 100 300 0 и 200 501 700.
Sample input
5
33 48 567 589 123
0 0 0 0 0
Sample output
33 48 0 0 123
0 0 567 589 0
*/
#include <stdio.h>

void zamena( int *a, int *b){
    if(*a>500){
        if(*b>500)
            *a=0;
        else{
            int temp=*a;
            *a=*b;
            *b=temp;
        }
    }

}

int main (){
    int n;
    scanf("%d",&n);
    int a[n],b[n];
    int i;
    for(i=0;i<n;i++)
        scanf("%d",&a[i]);
    for(i=0;i<n;i++)
        scanf("%d",&b[i]);
    for(i=0;i<n;i++){
        zamena(&a[i],&b[i]);
    }
    for(i=0;i<n;i++)
        printf("%d ",a[i]);
    printf("\n");
    for(i=0;i<n;i++)
        printf("%d ",b[i]);
return 0;
}
